Documents/ВводВЭксплуатацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВводВЭксплуатацию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьАК_НачислениеАмортизации</xr:Item>
				<xr:Item>InformationRegister.ПринятыеКУчетуОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременноТекстЗапросаВнешний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВводВЭксплуатацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВвода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизационнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписываетсяВМоментВвода</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местоположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаАмортизации</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияКУчету</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНМА</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийРасходСкладскойУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходСкладскойУчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаВТорговуюТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгрузкаТехнологу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОборудованияВТорговуюТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВСебестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаНуждыСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеОтходовОтПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утилизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтилизацияБой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаПитаниеСотрудниковСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОбработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВводВЭксплуатацию/Forms/ФормаПредвРаспредОСпоВиртСкладам/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Стр Из Этаформа.Параметры.ТЗРаспределение Цикл
		НовСтр = ТаблицаРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		НовСтр.Выбран = Истина;
	КонецЦикла;
	
	Ввод = ЭтаФорма.Параметры.Ввод;
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	ОКСервер();
	
	ЭтаФорма.Закрыть(Истина);	
	
КонецПроцедуры

&НаСервере
Процедура ОКСервер()
	
	МассивТочек = Новый Массив;
	
	Для Каждого Стр Из ТаблицаРаспределения Цикл
		Если Стр.Выбран Тогда
			Если МассивТочек.Найти(Стр.Местоположение) = Неопределено Тогда
				МассивТочек.Добавить(Стр.Местоположение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОборудованиеТТСкладОС = Новый ТаблицаЗначений;
	ОборудованиеТТСкладОС.Колонки.Добавить("ТТ");
	ОборудованиеТТСкладОС.Колонки.Добавить("Склад");
	ОборудованиеТТСкладОС.Колонки.Добавить("ОсновноеСредство");
	
	Для Каждого Стр Из ТаблицаРаспределения Цикл
		Если Стр.Выбран И НЕ Стр.БудетУдалено И ЗначениеЗаполнено(Стр.Местоположение) Тогда
			НовСтр = ОборудованиеТТСкладОС.Добавить();
			НовСтр.ТТ = Стр.Местоположение;
			НовСтр.ОсновноеСредство = Стр.ОсновноеСредство;
			
			НайдСтрСклад = Ввод.Оборудование.Найти(Стр.ОсновноеСредство, "ОсновноеСредство");
			
			НовСтр.Склад = НайдСтрСклад.Местоположение;
		КонецЕсли;
	КонецЦикла;
	
	ОборудованиеТТСклад = ОборудованиеТТСкладОС.Скопировать(, "Склад, ТТ");
	ОборудованиеТТСклад.Свернуть("Склад, ТТ");
	
	Для Каждого СтрПереместить Из ОборудованиеТТСклад Цикл
		
		Док = Документы.РасходныйОрдерСклад.СоздатьДокумент();
		Док.Дата = КонецМесяца(Ввод.Дата);
		Док.Получатель = СтрПереместить.ТТ;
		Док.Склад =  СтрПереместить.Склад;
		Док.ВидОперации = Перечисления.ВидыОперацийРасходСкладскойУчет.ПередачаОборудованияВТорговуюТочку;
		Док.Статус = Перечисления.СтатусыРасходныхОрдеров.ВСборке;
	
		СтрОборудованиеПоТочкам = ОборудованиеТТСкладОС.НайтиСтроки(Новый структура("ТТ, Склад", СтрПереместить.ТТ, СтрПереместить.Склад));
	
		Для Каждого СтрОборудование Из СтрОборудованиеПоТочкам Цикл
	
			НовСтрОб = Док.Оборудование.Добавить();
			НовСтрОБ.Номенклатура = СтрОборудование.ОсновноеСредство.Номенклатура;
			НовСтрОб.Оборудование = СтрОборудование.ОсновноеСредство;		
		
		КонецЦикла;
	
		Если Док.Оборудование.Количество() <> 0 Тогда
			
			Док.НеМенятьДатуПриПроведении = Истина;
		
			Попытка
				Док.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать расходный ордер распределения оборудования виртуального склада поставщика!" + Символы.ПС + ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
		
			ОбщегоНазначения.СообщитьОбОшибке("Записан расходный ордер распределения оборудования виртуального склада: " + Строка(Док.Ссылка), , , СтатусСообщения.Информация);
		
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ОбщегоНазначения.СообщитьОбОшибке("Не удалось провести расходный ордер распределения оборудования виртуального склада поставщика!" + Символы.ПС + ОписаниеОшибки());				
			КонецПопытки;
		
			ОбщегоНазначения.СообщитьОбОшибке("Проведен расходный ордер распределения оборудования виртуального склада: " + Строка(Док.Ссылка), , , СтатусСообщения.Информация);
		
		КонецЕсли;
	
	КонецЦикла;	

	МассивСтрДляУд = Новый Массив;

	//ДЛя Каждого ОбДляУд Из МассивОбДляУд Цикл
	//	НайдСтроки = Объект.Оборудование.НайтиСтроки(Новый Структура("ОсновноеСредство", ОбДляУд));
	//
	//	Для Каждого НСтр Из НайдСтроки Цикл
	//		МассивСтрДляУд.Добавить(НСтр);
	//	КонецЦикла;
	//КонецЦИкла;

	//Для Каждого СтрДляУд Из МассивСтрДляУд Цикл
	//	ОБъект.Оборудование.Удалить(СтрДляУд);
	//КонецЦикла;
	
	ВводОб = Ввод.ПолучитьОбъект();
	
	Для Каждого Стр Из ТаблицаРаспределения Цикл
		Если Стр.Выбран И Стр.БудетУдалено Тогда
			
			НайдСтр = ВводОб.Оборудование.Найти(Стр.ОсновноеСредство, "ОсновноеСредство");
			
			МассивСтрДляУд.Добавить(НайдСтр);
			
		КонецЕсли;
	КонецЦикла;
		
	Для Каждого Стр Из МассивСтрДляУд Цикл
		ВводОб.Оборудование.Удалить(Стр);
	КонецЦикла;
	
	Если МассивСтрДляУд.Количество() Тогда
		ВводОб.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	
	ЭтаФорма.Закрыть(Ложь);	
	
КонецПроцедуры
